Repository: openSUSE/searchPage
Catalog: po/tzm.po
Languages: tzm

source: openSUSE search
tzm: Arezzu openSUSE

source: Get software
tzm: Agem aɣawas

source: Build Service
tzm: Tanafut n tuṣka

source: What are you searching for?
tzm: Maɣef trezzud?

source: Search with PrivacyTools
tzm: Rzu s PrivacyTools

source: Powered by
tzm: Ittusker s

source: Social Network
tzm: Azeṭṭa anamun

source: News
tzm: Ineɣmisen

source: Forums
tzm: Isegrawen

source: Shop
tzm: Taḥanut

source: Blogs
tzm: Tugriwt

source: Press
tzm: Tanɣmast

source: Change language
tzm: Senfel tutlayt
